## Workflow of SQL querying
● Import packages and functions

● Create the database engine

● Connect to the engine

● Query the database

● Save query results to a DataFrame

● Close the connection

In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [28]:
engine = create_engine('sqlite:///chinook.db') #file should be in current dir pynb file

In [29]:
con= engine.connect()

In [30]:
engine.table_names()

['albums',
 'artists',
 'customers',
 'employees',
 'genres',
 'invoice_items',
 'invoices',
 'media_types',
 'playlist_track',
 'playlists',
 'sqlite_sequence',
 'sqlite_stat1',
 'tracks']

In [31]:
rs = con.execute("SELECT * FROM albums")

In [32]:
df = pd.DataFrame(rs.fetchall())

In [33]:
rs.keys()

['AlbumId', 'Title', 'ArtistId']

In [34]:
df.columns=rs.keys()

In [35]:
df.head()

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

In [36]:
con.close()

### Using the context manager

In [37]:
with engine.connect() as con:
    rs= con.execute("select * from albums")
    df= pd.DataFrame(rs.fetchall())
    df.columns= rs.keys()

In [38]:
df.head()

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

## Power of Pandas

In [39]:
df= pd.read_sql_table("albums",engine)

In [40]:
df.head()

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

In [42]:
df= pd.read_sql_query("select * from albums limit 2",engine)

In [43]:
df.head()

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2

## Connect ot MS SQL

### Window Auth: 
    engine = create_engine('mssql+pyodbc://server/database')
### SQL Auth: 
    engine = create_engine('mssql+pyodbc://user:password@server/database')

In [45]:
import pyodbc

In [48]:
mssql_engine = create_engine('mssql+pyodbc://sa:noida@123@172.20.10.7/SSI_DEV_QUAL?driver=SQL+Server+Native+Client+11.0')

In [49]:
df=pd.read_sql("select top 2 * from mbd.item_master",mssql_engine)

In [50]:
df.head()

,id,item_ms_client_seq_id,client_id,item_number,short_description,long_description,uom,mfg_name,mfg_pt_number,min_qty,...,sup_name,sup_pt_number,brand,category_level_1,category_level_2,category_level_3,classification,ms_mfg_name,source_ext$,item_type
0,1,351,1,DC0000351,DIAPHRAGM SUPPORT ARC,DIAPHRAGM SUPPORT ARC,None,Alfa Laval,3135308161,None,...,None,None,None,9,27,None,1608,None,None,None
1,2,352,1,DC0000352,"DIAPHRAGM SUPPORT 3"" 4"" ARC","DIAPHRAGM SUPPORT 3"" 4"" ARC",None,Alfa Laval,3135308162,None,...,None,None,None,9,27,None,1608,None,None,None